{"convertedBy": "TensorFlow.js Converter v3.18.0", "format": "layers-model", "modelTopology": {"model_config": {"config": {"layers": [{"config": {"trainable": true, "activation": "linear", "activity_regularizer": null, "bias_constraint": null, "kernel_initializer": {"config": {"seed": null, "dtype": "float32"}, "class_name": "GlorotUniform"}, "name": "dense", "dtype": "float32", "use_bias": true, "batch_input_shape": [null, 1], "bias_regularizer": null, "kernel_constraint": null, "kernel_regularizer": null, "units": 1, "bias_initializer": {"config": {"dtype": "float32"}, "class_name": "Zeros"}}, "class_name": "Dense"}], "name": "sequential"}, "class_name": "Sequential"}, "training_config": {"loss": "mean_absolute_error", "metrics": [], "loss_weights": null, "weighted_metrics": null, "optimizer_config": {"config": {"name": "SGD", "momentum": 0.0, "nesterov": false, "learning_rate": 0.009999999776482582, "decay": 0.0}, "class_name": "SGD"}, "sample_weight_mode": null}, "keras_version": "2.2.4-tf", "backend": "tensorflow"}, "generatedBy": "keras v2.2.4-tf", "weightsManifest": [{"paths": ["group1-shard1of1.bin"], "weights": [{"dtype": "float32", "name": "dense/kernel", "shape": [1, 1]}, {"dtype": "float32", "name": "dense/bias", "shape": [1]}]}]}